IvanNaum/component_tester/firmware/stm32f103c8tx/USB_DEVICE/Target/usbd_conf.h
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : usbd_conf.h
 * @version        : v2.0_Cube
 * @brief          : Header for usbd_conf.c file.
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef USBD_CONF_H
#define USBD_CONF_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "main.h"
#include "stm32f1xx.h"
#include "stm32f1xx_hal.h"

/* USER CODE BEGIN INCLUDE */

/* USER CODE END INCLUDE */

/** @addtogroup USBD_OTG_DRIVER
 * @{
 */

/** @defgroup USBD_CONF USBD_CONF
 * @brief Configuration file for Usb otg low level driver.
 * @{
 */

/** @defgroup USBD_CONF_Exported_Variables USBD_CONF_Exported_Variables
 * @brief Public variables.
 * @{
 */

/**
 * @}
 */

/** @defgroup USBD_CONF_Exported_Defines USBD_CONF_Exported_Defines
 * @brief Defines for configuration of the Usb device.
 * @{
 */

/*---------- -----------*/
#define USBD_MAX_NUM_INTERFACES 1
/*---------- -----------*/
#define USBD_MAX_NUM_CONFIGURATION 1
/*---------- -----------*/
#define USBD_MAX_STR_DESC_SIZ 512
/*---------- -----------*/
#define USBD_DEBUG_LEVEL 0
/*---------- -----------*/
#define USBD_SELF_POWERED 1
/*---------- -----------*/
#define MAX_STATIC_ALLOC_SIZE 512

/****************************************/
/* #define for FS and HS identification */
#define DEVICE_FS 0

/**
 * @}
 */

/** @defgroup USBD_CONF_Exported_Macros USBD_CONF_Exported_Macros
 * @brief Aliases.
 * @{
 */

/* Memory management macros */

/** Alias for memory allocation. */
#define USBD_malloc (uint32_t*)USBD_static_malloc

/** Alias for memory release. */
#define USBD_free USBD_static_free

/** Alias for memory set. */
#define USBD_memset /* Not used */

/** Alias for memory copy. */
#define USBD_memcpy /* Not used */

/** Alias for delay. */
#define USBD_Delay HAL_Delay

/* For footprint reasons and since only one allocation is handled in the HID class
   driver, the malloc/free is changed into a static allocation method */
void* USBD_static_malloc(uint32_t size);
void USBD_static_free(void* p);

/* DEBUG macros */

#if (USBD_DEBUG_LEVEL > 0)
#define USBD_UsrLog(...) \
    printf(__VA_ARGS__); \
    printf("\n");
#else
#define USBD_UsrLog(...)
#endif

#if (USBD_DEBUG_LEVEL > 1)

#define USBD_ErrLog(...) \
    printf("ERROR: ");   \
    printf(__VA_ARGS__); \
    printf("\n");
#else
#define USBD_ErrLog(...)
#endif

#if (USBD_DEBUG_LEVEL > 2)
#define USBD_DbgLog(...) \
    printf("DEBUG : ");  \
    printf(__VA_ARGS__); \
    printf("\n");
#else
#define USBD_DbgLog(...)
#endif

/**
 * @}
 */

/** @defgroup USBD_CONF_Exported_Types USBD_CONF_Exported_Types
 * @brief Types.
 * @{
 */

/**
 * @}
 */

/** @defgroup USBD_CONF_Exported_FunctionsPrototype USBD_CONF_Exported_FunctionsPrototype
 * @brief Declaration of public functions for Usb device.
 * @{
 */

/* Exported functions -------------------------------------------------------*/

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif  // USBD_CONF_H
